export const messages = {
  errorRequired: "Це поле обов'язкове. Не може бути порожнім",
  errorText: "Не менше двох символів, лише кирилиця",
  errorName: "Від двох символів, лише кирилиця",
  errorPhone: "Починайте з нуля, введіть 10 символів",
  errorMail: "Не менше 6 символів, знак @ та домен пошти",
  errorAdress: "Не менше двох символів",
  errorEmpty: "Це поле не може бути пустим",
  correct: "Все правильно, заповнюйте далі!",
};

export const popupMsg = {
  promotionPopupText: {
    titleText: "Дякуємо за вашу зацікавленість",
    text: "Ми будемо повідомляти вас про нові товари, акції та інші цікаві події.",
  },
  basketPopupText: {
    titleText: "Товар доданий до кошика",
    text: "Продовжуйте шопінг або перегляньте ваш <a class='product__basket' href='basket.html'>кошик</a>.",
  },
  orderPopupText: {
    titleText: "Дякуємо за ваше замовлення",
    text: "Ми отримали ваш запит і незабаром зв'яжемося з вами для підтвердження деталей замовлення.<br /> Реквізити для оплати: <b>1111 1111 1111 1111.</b> ",
  },
  orderSecondPopupText: {
    titleText: "Дякуємо за ваше замовлення",
    text: "Відправка протягом трьох днів. <br />Реквізити для оплати: <b>1111 1111 1111 1111.</b>",
  },
  contactPopupText: {
    titleText: "Дякуємо за ваше повідомлення",
    text: "Ми отримали ваш запит і незабаром зв'яжемося  для вирішення вашого питання.",
  }
};